Revit.Elements.Floor
A Revit Floor

Revit.Elements.Floor.#ctor(Autodesk.Revit.DB.Floor)
Private constructor

Revit.Elements.Floor.#ctor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Floor.InitFloor(Autodesk.Revit.DB.Floor)
Initialize a floor element

Revit.Elements.Floor.InitFloor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level)
Initialize a floor element

Revit.Elements.Floor.InternalSetFloor(Autodesk.Revit.DB.Floor)
Set the InternalFloor property and the associated element id and unique id
floor:

Revit.Elements.Floor.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.FloorType,Revit.Elements.Level)
Create a Revit Floor given it's curve outline and Level
outlineCurves:
floorType:
level:
Returns: The floor

Revit.Elements.Floor.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,Revit.Elements.FloorType,Revit.Elements.Level)
Create a Revit Floor given it's curve outline and Level
outline:
floorType:
level:
Returns: The floor

Revit.Elements.Floor.FromExisting(Autodesk.Revit.DB.Floor,System.Boolean)
Create a Floor from a user selected Element.
floor:
isRevitOwned:
Returns:

Revit.Elements.Floor.InternalFloor
An internal handle on the Revit floor

Revit.Elements.Floor.InternalElement
Reference to the Element